driver-tests/bpelse/implementMultiOperations/OneBPELJBI/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tas="http://jbi.com.sun/wfse/wsdl/TaskCommon">
  <soapenv:Body>
    <tas:ClaimTask>
      <taskId>123</taskId>
    </tas:ClaimTask>
  </soapenv:Body>
</soapenv:Envelope>