driver-tests/bpelse/implementMultiOperations/MultipleBPELsJBI/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tas="http://jbi.com.sun/wfse/wsdl/TaskCommon">
  <soapenv:Body>
    <tas:RevokeTask>
      <taskId>xyz</taskId>
    </tas:RevokeTask>
  </soapenv:Body>
</soapenv:Envelope>